#1

# list = ['New-York','USA','Russian','Japan','Korea','Kia','Tayota','Daf','Scania','Volvo','Сирень','нарекай','Baby я не твой','Байландым','Danza kuduro']
# print(list[2:7])

#2

# list = [1,2,3,4,5,6,7,8,9]
# list.reverse()
# print(list)

#3

# a = [1,3,4,5]
# b = [4,5,6,7]
# list = (a+b)
# print(set(list))

#4

# print(min(list))

#5
# list.clear()
# print(list)

#6

# print(sum(list))

#7

# print(sum(list) / len(list))

#8

# list = ['Нарекай','Formidable','Out of my head','На грани','Январь','Любовь как сон','Эталон кросаты','Тихий океан','Зеленные глаза','sugar']
# list[4], list[8] = list[8], list[4]
# print(list)

#9

# list = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99, 100, 101, 102, 103, 104, 105, 106, 107, 108, 109, 110, 111, 112, 113, 114, 115, 116, 117, 118, 119, 120, 121, 122, 123, 124, 125, 126, 127, 128, 129, 130, 131, 132, 133, 134, 135, 136, 137, 138, 139, 140, 141, 142, 143, 144, 145, 146, 147, 148, 149, 150, 151, 152, 153, 154, 155, 156, 157, 158, 159, 160, 161, 162, 163, 164, 165, 166, 167, 168, 169, 170, 171, 172, 173, 174, 175, 176, 177, 178, 179, 180, 181, 182, 183, 184, 185, 186, 187, 188, 189, 190, 191, 192, 193, 194, 195, 196, 197, 198, 199, 200, 201, 202, 203, 204, 205, 206, 207, 208, 209, 210, 211, 212, 213, 214, 215,
# 216, 217, 218, 219, 220, 221, 222, 223, 224, 225, 226, 227, 228, 229, 230, 231, 232, 233, 234, 235, 236, 237, 238, 239, 240, 241, 242, 243, 244, 245, 246, 247, 248, 249, 250, 251, 252, 253, 254, 255, 256, 257, 258, 259, 260, 261, 262, 263, 264, 265, 266, 267, 268, 269, 270, 271, 272, 273, 274, 275, 276, 277, 278, 279, 280, 281, 282, 283, 284, 285, 286, 287, 288, 289, 290, 291, 292, 293, 294, 295, 296, 297, 298, 299, 110, 111, 112, 113, 114, 115, 116, 117, 118, 119, 120, 121, 122, 123, 124, 125, 126, 127, 128, 129, 130, 131, 132, 133, 134, 135, 136, 137, 138, 139, 140, 141, 142, 143, 144, 145, 146, 147, 148, 149, 150, 250, 251, 252, 253, 254, 255, 256, 257, 258, 259, 260, 261, 262, 263, 264, 265, 266, 267, 268, 269, 270, 271, 272, 273, 274, 275, 276, 277, 278, 279, 280, 281, 282, 283, 284, 285, 286, 287, 288, 289, 290, 291, 292, 293, 294, 295, 296, 297, 298, 299, 110]
# print(list.count(110))

#10
# password1 = 'geeks'
# password = input('введите пароль: ')
# if password == password1:
#     print("Password is correct. You are welcome")
# else:
#     print("Password is incorrect. Please, try again")

#11

# weather = int(input('Введите погоду за окном: '))
# if weather < -30:
#     print("Там так холодно, лучше дома сиди!")
# elif 0 <= weather < -30:
#     print("Холодновато. Оденься потеплее!")
# elif 15 <= weather < 0:
#     print("Прохладно. Куртку накинь!")
# elif 30 <= weather < 15:
#     print("Тепло. Иди погуляй в парке!")
# elif 50 <= weather < 30:
#     print("Ого, как жарко!")
# elif weather > 50:
#     print("Там такая жара, лучше сиди дома!")
# else:
#     print("Ошибка!")


# day = int(input('Введите время: '))
# if 0 <= day < 6:
#     print("Ночь")
# elif 7 <= day < 12:
#     print("Утро")
# elif 13 <= day < 18:
#     print("День")
# elif 18 <= day < 23:
#     print("Вечер")

#Доп

# grade = int(input('Введите оценку: '))
# if  grade > 90:
#     print("Отлично")
# elif 80 <= grade < 90:
#     print("Хорошо")
# elif 70 <= grade < 80:
#     print("Удовлетворительно")
# elif 60 <= grade < 70:
#     print("Неудовлетворительно")
# elif grade < 60:
#     print("Студент должен пересдать экзамен")    
    
    